# Задание 3
# Какое слово нужно сложить 5 раз чтобы получить число 5?
# Какое слово нужно умножить на 7 чтобы получить 7?


#1
n = '1'
s = int(n) + int(n) + int(n) + int(n) + int(n)
print(s)


#2
k = int(n) * 7
print(k)